===
numbers
===

1
1.0
+1
-1
-1.0
.1
+.1
1e1
1e-1
1_0.1_0
0x1
-0x1
0x1.1
+0x1.1
0x1p1
-0x1_0.1_0p1_0

---

(program
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number)
  (number))

===
strings
===

"string"
"string\""
"string\\"
"\115\116\114"
"\x32\u{33}"

---

(program
  (double_quote_string
    (string_content))
  (double_quote_string
    (string_content
      (escape_sequence)))
  (double_quote_string
    (string_content
      (escape_sequence)))
  (double_quote_string
    (string_content
      (escape_sequence)
      (escape_sequence)
      (escape_sequence)))
  (double_quote_string
    (string_content
      (escape_sequence)
      (escape_sequence))))

===
colon strings
===

:test
:*
:#
:?
:-
:+
:9
:_
:/
:<
:>
:=
:^

---

(program
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content))
  (colon_string (string_content)))

===
quote
===

'[]
`123
`(+ ,a ,b)
`("")
'(fn)
(quote (each))
'(let [x (each [y] z)])

---
(program
  (quote
    (quoted_sequential_table))
  (quote
    (number))
  (quote
    (quoted_list
      (symbol)
      (unquote
        (symbol))
      (unquote
        (symbol))))
  (quote
    (quoted_list
      (double_quote_string)))
  (quote
    (quoted_list
      (symbol)))
  (quote
    (quoted_list
      (symbol)))
  (quote
    (quoted_list
      (symbol)
      (quoted_sequential_table
        (symbol)
        (quoted_list
          (symbol)
          (quoted_sequential_table
            (symbol))
          (symbol))))))

===
symbols
===

a
?a
a?
$1
$
<>
test#test#test
.
..

---

(program
  (symbol)
  (symbol)
  (symbol)
  (symbol)
  (symbol)
  (symbol)
  (symbol)
  (symbol)
  (symbol))

===
booleans + nil
===

true
false
nil

---

(program
  (boolean)
  (boolean)
  (nil))

===
tables
===

{: value
 "key" value
 "number" 531
 "f" (fn [x] (+ x 2))}
{key value}

---

(program
  (table
    (symbol)
    (double_quote_string
      (string_content))
    (symbol)
    (double_quote_string
      (string_content))
    (number)
    (double_quote_string
      (string_content))
    (fn
      (parameters
        (binding
          (symbol)))
      (list
        (symbol)
        (symbol)
        (number))))
  (table
    (symbol)
    (symbol)))

===
sequential tables
===

["abd" "def" "xyz"]

---

(program
  (sequential_table
    (double_quote_string
      (string_content))
    (double_quote_string
      (string_content))
    (double_quote_string
      (string_content))))

===
comments
===

; this is a comment
(fn ;
 foo ;
 [ ;
 x ;
 ] ;
 x ;
 ) ;

---

(program
  (comment)
  (fn
    (comment)
    name: (symbol)
    (comment)
    (parameters
      (comment)
      (binding
        (symbol))
      (comment))
    (comment)
    (symbol)
    (comment))
  (comment))

===
multi-syms
===

(string.format "%d" 1)

---

(program
  (list
    (multi_symbol
      (symbol)
      (symbol))
    (double_quote_string
      (string_content))
    (number)))

===
vararg
===

...
(fn [x y ...] ...)

---

(program
  (vararg)
  (fn
    (parameters
      (binding
        (symbol))
      (binding
        (symbol))
      (vararg))
    (vararg)))

====
Nil Safe
====

(?. foo :bar)

---

(program
  (list
    (nil_safe)
    (symbol)
    (colon_string
      (string_content))))
