===
function call
===

(test 1 a)

---

(program 
  (function_call
    name: (identifier)
    (number)
    (identifier)))

===
function definition
===

(fn test [a] a)

---

(program
  (function_definition
    name: (identifier)
    parameters: (identifier)
    body: (identifier)))

===
table
===

{"key" value
 "number" 531
 "f" (fn [x] (+ x 2))}

---

(program
  (table
    (string)
    (identifier)
    (string)
    (number)
    (string)
    (function_definition
      parameters: (identifier)
      body: (function_call 
              name: (identifier)
              (identifier)
              (number)))))

===
sequential table
===

["abd" "def" "xyz"]

---

(program
  (sequential_table
    (string)
    (string)
    (string)))
