===
function call
===

(test 1 a)

---

(program
  (function_call
    name: (identifier)
    (number)
    (identifier)))

===
function definition
===

(fn test [a] a)

---

(program
  (function_definition
    name: (identifier)
    (parameters 
      (identifier))
    body: (identifier)))

===
lambda definition
===

(lambda test [a] a)

---

(program
  (lambda_definition
    name: (identifier)
    (parameters
      (identifier))
    body: (identifier)))

===
table
===

{"key" value
 "number" 531
 "f" (fn [x] (+ x 2))}

---

(program
  (table
    (string)
    (identifier)
    (string)
    (number)
    (string)
    (function_definition
      (parameters
        (identifier))
      body: (function_call
              name: (identifier)
              (identifier)
              (number)))))

===
sequential table
===

["abd" "def" "xyz"]

---

(program
  (sequential_table
    (string)
    (string)
    (string)))

===
let definition
===

(let [x (+ 89 5.2)
      f (fn [abc] (print (* 2 abc)))]
  (f x))

---

(program
  (let_definition
    (assignments
      (assignment
        (identifier)
        (function_call
          name: (identifier)
          (number)
          (number)))
      (assignment
        (identifier)
        (function_definition
          (parameters
            (identifier))
          body: (function_call
                  name: (identifier)
                  (function_call
                    name: (identifier)
                    (number)
                    (identifier))))))
    (function_call
      name: (identifier)
      (identifier))))

===
local definition
===

(local tau-approx 6.28318)

---

(program
  (local_definition
    (assignment
      (identifier)
      (number))))

===
var definition
===

(var x 19)

---

(program
  (var_definition
    (assignment
      (identifier)
      (number))))

===
global definition
===

(global add (fn [x y] (+ x y)))

---

(program
  (global_definition
    (assignment
      (identifier)
      (function_definition
        (parameters
          (identifier)
          (identifier))
        body: (function_call
                name: (identifier)
                (identifier)
                (identifier))))))
