===
function call
===

(test 1 a)

---

(program
  (function_call
    name: (identifier)
    (number)
    (identifier)))

===
function definition
===

(fn test [a] a)

---

(program
  (function_definition
    name: (identifier)
    (parameters 
      (identifier))
    body: (identifier)))

===
lambda definition
===

(lambda test [a] a)

---

(program
  (lambda_definition
    name: (identifier)
    (parameters
      (identifier))
    body: (identifier)))


===
let definition
===

(let [x (+ 89 5.2)
      f (fn [abc] (print (* 2 abc)))]
  (f x))

---

(program
  (let_definition
    (assignments
      (assignment
        (identifier)
        (function_call
          name: (identifier)
          (number)
          (number)))
      (assignment
        (identifier)
        (function_definition
          (parameters
            (identifier))
          body: (function_call
                  name: (identifier)
                  (function_call
                    name: (identifier)
                    (number)
                    (identifier))))))
    (function_call
      name: (identifier)
      (identifier))))

===
local definition
===

(local tau-approx 6.28318)

---

(program
  (local_definition
    (assignment
      (identifier)
      (number))))

===
var definition
===

(var x 19)

---

(program
  (var_definition
    (assignment
      (identifier)
      (number))))

===
global definition
===

(global add (fn [x y] (+ x y)))

---

(program
  (global_definition
    (assignment
      (identifier)
      (function_definition
        (parameters
          (identifier)
          (identifier))
        body: (function_call
                name: (identifier)
                (identifier)
                (identifier))))))

===
each loop
===

(each [key value (pairs {"key1" 52 "key2" 99})]
  (print key value))

---

(program
  (each 
    (each_clause
      (identifier)
      (identifier)
      (function_call
        name: (identifier)
        (table
          (string)
          (number)
          (string)
          (number))))
    (function_call
      name: (identifier)
      (identifier)
      (identifier))))
    
===
for loop
===

(for [i 1 10]
  (print i))

(for [i 1 10 2]
  (print i))

---

(program
  (for
    (for_clause
      (identifier)
      (number)
      (number))
    (function_call
      name: (identifier)
      (identifier)))
  (for
    (for_clause
      (identifier)
      (number)
      (number)
      (number))
    (function_call
      name: (identifier)
      (identifier))))

===
while loop
===

(while (keep-looping?)
  (do-something))

---

(program
  (while
    condition: (function_call 
                name: (identifier))
    (function_call
      name: (identifier))))

===
if statement
===

(let [x (math.random 64)]
  (if (= 0 (% x 2))
      "even"
      (= 0 (% x 10))
      "multiple of ten"
      "I dunno, something else"))

---

(program
  (let_definition
    (assignments
      (assignment
        (identifier)
        (function_call
          name: (identifier)
          (number))))
    (if_statement
     (function_call
      name: (identifier)
      (number)
      (function_call
       name: (identifier)
       (identifier)
       (number)))
      (string)
      (function_call
        name: (identifier)
        (number)
        (function_call
         name: (identifier)
         (identifier)
         (number)))
      (string)
      (string))))
        
===
when statement
===

(when (currently-raining?)
  (wear "boots")
  (deploy-umbrella))

---

(program
  (when_statement
    (function_call name: (identifier))
    (function_call 
      name: (identifier)
      (string))
    (function_call name: (identifier))))
