===
function call
===

(test 1 a)
(test (test))

---

(program
  (list
    (symbol)
    (number)
    (symbol))
  (list
    (symbol)
    (list
      (symbol))))

===
method call
===

(test.test:method :arg)
(test.test :method :arg)

---

(program
  (list
    (multi_symbol_method
      (multi_symbol
        (symbol)
        (symbol))
      (symbol))
    (string))
  (list
    (multi_symbol
      (symbol)
      (symbol))
    (string)
    (string)))


===
function definition
===

(fn test [a] a)

---

(program
  (function_definition
    name: (symbol)
    (parameters
      (symbol))
    body: (symbol)))

===
function definition (dotted)
===

(fn test.test [a] a)

---

(program
  (function_definition
    name: (multi_symbol
            (symbol)
            (symbol))
    (parameters
      (symbol))
    body: (symbol)))

===
lambda definition
===

(lambda test [a] a)
(Î» test [a] a)

---

(program
  (lambda_definition
    name: (symbol)
    (parameters
      (symbol))
    body: (symbol))
  (lambda_definition
    name: (symbol)
    (parameters
      (symbol))
    body: (symbol)))

===
hash function
===

(hashfn (+ $1 $2))
#(+ $1 $2)
#$3
#[$1 $2 $3]
#$
#val
#[:one :two]

---

(program
  (hash_function_definition
    (list
      (symbol)
      (symbol)
      (symbol)))
  (hash_function_definition
    (list
      (symbol)
      (symbol)
      (symbol)))
  (hash_function_definition
    (symbol))
  (hash_function_definition
    (sequential_table
      (symbol)
      (symbol)
      (symbol)))
  (hash_function_definition
    (symbol))
  (hash_function_definition
    (symbol))
  (hash_function_definition
    (sequential_table
      (string)
      (string))))

===
let definition
===

(let [x (+ 89 5.2)
      f (fn [abc] (print (* 2 abc)))]
  (f x))

(let [(file-handle message code) (io.open "foo.blah")]
  message)

---

(program
  (let_definition
    (let_clause
      (assignment
        (symbol)
        (list
          (symbol)
          (number)
          (number)))
      (assignment
        (symbol)
        (function_definition
          (parameters
            (symbol))
          body: (list
                  (symbol)
                  (list
                    (symbol)
                    (number)
                    (symbol))))))
    (list
      (symbol)
      (symbol)))
  (let_definition
    (let_clause
      (multi_value_assignment
        (value_list
          (symbol)
          (symbol)
          (symbol))
        (list
          (multi_symbol
            (symbol)
            (symbol))
          (string))))
    (symbol)))

===
local definition
===

(local tau-approx 6.28318)
(local (_ _ z) (unpack [:a :b :c :d :e]))

---

(program
  (local_definition
    (assignment
      (symbol)
      (number)))
  (local_definition
    (multi_value_assignment
      (value_list
        (symbol)
        (symbol)
        (symbol))
      (list
        (symbol)
        (sequential_table
          (string)
          (string)
          (string)
          (string)
          (string))))))

===
var definition
===

(var x 19)
(var (a b) (values 1 2))

---

(program
  (var_definition
    (assignment
      (symbol)
      (number)))
  (var_definition
    (multi_value_assignment
      (value_list
        (symbol)
        (symbol))
      (list
        (symbol)
        (number)
        (number)))))

===
global definition
===

(global add (fn [x y] (+ x y)))
(global (x-m x-e) (math.frexp 21))

---

(program
  (global_definition
    (assignment
      (symbol)
      (function_definition
        (parameters
          (symbol)
          (symbol))
        body: (list
                (symbol)
                (symbol)
                (symbol)))))
  (global_definition
    (multi_value_assignment
      (value_list
        (symbol)
        (symbol))
      (list
        (multi_symbol
          (symbol)
          (symbol))
        (number)))))

===
set statement
===

(set x (+ x 91))
(set (a b) (values 1 2))
(set a.b 1)
(set b :*)

---

(program
  (set
    (assignment
      (symbol)
      (list
        (symbol)
        (symbol)
        (number))))
  (set
    (multi_value_assignment
      (value_list
        (symbol)
        (symbol))
      (list
        (symbol)
        (number)
        (number))))
  (set
    (assignment
      (multi_symbol
        (symbol)
        (symbol))
      (number)))
  (set
    (assignment
      (symbol)
      (string))))

===
tset statement
===

(tset tbl field 19)
(tset tbl "field" b)

---

(program
  (tset
    (symbol)
    (symbol)
    (number))
  (tset
    (symbol)
    (string)
    (symbol)))

===
each loop
===

(each [key value (pairs {"key1" 52 "key2" 99})]
  (print key value))

---

(program
  (each
    (each_clause
      (symbol)
      (symbol)
      (list
        (symbol)
        (table
          (string)
          (number)
          (string)
          (number))))
    (list
      (symbol)
      (symbol)
      (symbol))))

===
for loop
===

(for [i 1 10]
  (print i))

(for [i 1 10 2]
  (print i))

---

(program
  (for
    (for_clause
      (symbol)
      (number)
      (number))
    (list
      (symbol)
      (symbol)))
  (for
    (for_clause
      (symbol)
      (number)
      (number)
      (number))
    (list
      (symbol)
      (symbol))))

===
while loop
===

(while (keep-looping?)
  (do-something))

---

(program
  (while
    condition: (list
                 (symbol))
    (list
      (symbol))))

===
if statement
===

(let [x (math.random 64)]
  (if (= 0 (% x 2))
      "even"
      (= 0 (% x 10))
      "multiple of ten"
      "I dunno, something else"))

---

(program
  (let_definition
    (let_clause
      (assignment
        (symbol)
        (list
          (multi_symbol
            (symbol)
            (symbol))
          (number))))
    (if_statement
      (list
        (symbol)
        (number)
        (list
          (symbol)
          (symbol)
          (number)))
      (string)
      (list
        (symbol)
        (number)
        (list
          (symbol)
          (symbol)
          (number)))
      (string)
      (string))))

===
when statement
===

(when (currently-raining?)
  (wear "boots")
  (deploy-umbrella))

---

(program
  (when_statement
    (list
      (symbol))
    (list
      (symbol)
      (string))
    (list
      (symbol))))

===
do statement
===

(do
  (wear "boots")
  (deploy-umbrella))

---

(program
  (do_statement
    (list
      (symbol)
      (string))
    (list
      (symbol))))

===
match statement
===

(match a
  b (print "boots")
  8 (deploy-umbrella))

---

(program
  (match_statement
    (symbol)
    (symbol)
    (list
      (symbol)
      (string))
    (number)
    (list
      (symbol))))

===
require statement
===

(require :module)
(require "module")

---

(program
  (require
    (string))
  (require
    (string)))
