===
function call
===

(test 1 a)

---

(program
  (function_call
    name: (identifier)
    (number)
    (identifier)))

===
function definition
===

(fn test [a] a)

---

(program
  (function_definition
    name: (identifier)
    (parameters 
      (identifier))
    body: (identifier)))

===
lambda definition
===

(lambda test [a] a)
(Î» test [a] a)

---

(program
  (lambda_definition
    name: (identifier)
    (parameters
      (identifier))
    body: (identifier))
  (lambda_definition
    name: (identifier)
    (parameters
      (identifier))
    body: (identifier)))

===
hash function
===

(hashfn (+ $1 $2))
#(+ $1 $2)
#$3
#[$1 $2 $3]
#$
#val
#[:one :two]

---

(program
  (hash_function_definition
   (function_call 
     name: (identifier)
     (identifier)
     (identifier)))
  (hash_function_definition
   (function_call 
     name: (identifier)
    (identifier)
    (identifier)))
  (hash_function_definition
     (identifier))
  (hash_function_definition
     (sequential_table
       (identifier)
       (identifier)
       (identifier)))
  (hash_function_definition
     (identifier))
  (hash_function_definition
     (identifier))
  (hash_function_definition
     (sequential_table
       (identifier)
       (identifier))))

===
let definition
===

(let [x (+ 89 5.2)
      f (fn [abc] (print (* 2 abc)))]
  (f x))

(let [(file-handle message code) (io.open "foo.blah")]
  message)

---

(program
  (let_definition
    (assignments
      (assignment
        (identifier)
        (function_call
          name: (identifier)
          (number)
          (number)))
      (assignment
        (identifier)
        (function_definition
          (parameters
            (identifier))
          body: (function_call
                  name: (identifier)
                  (function_call
                    name: (identifier)
                    (number)
                    (identifier))))))
    (function_call
      name: (identifier)
      (identifier)))
  (let_definition
    (assignments
      (multi_value_assignment
        (value_list
          (identifier)
          (identifier)
          (identifier))
        (function_call
          name: (identifier)
          (string))))
     (identifier)))

===
local definition
===

(local tau-approx 6.28318)
(local (_ _ z) (unpack [:a :b :c :d :e]))

---

(program
  (local_definition
    (assignment
      (identifier)
      (number)))
  (local_definition
    (multi_value_assignment
      (value_list
        (identifier)
        (identifier)
        (identifier))
      (function_call
        name: (identifier)
        (sequential_table
          (identifier)
          (identifier)
          (identifier)
          (identifier)
          (identifier))))))

===
var definition
===

(var x 19)
(var (a b) (values 1 2))

---

(program
  (var_definition
    (assignment
      (identifier)
      (number)))
  (var_definition
    (multi_value_assignment
      (value_list
        (identifier)
        (identifier))
      (function_call
        name: (identifier)
        (number)
        (number)))))

===
global definition
===

(global add (fn [x y] (+ x y)))
(global (x-m x-e) (math.frexp 21))

---

(program
  (global_definition
    (assignment
      (identifier)
      (function_definition
        (parameters
          (identifier)
          (identifier))
        body: (function_call
                name: (identifier)
                (identifier)
                (identifier)))))
  (global_definition
    (multi_value_assignment
      (value_list
        (identifier)
        (identifier))
      (function_call
        name: (identifier)
        (number)))))

===
set statement
===

(set x (+ x 91))
(set (a b) (values 1 2))

---

(program
  (set
    (assignment
      (identifier)
      (function_call
       name: (identifier)
       (identifier)
       (number))))
  (set
    (multi_value_assignment
      (value_list
        (identifier)
        (identifier))
      (function_call
        name: (identifier)
        (number)
        (number)))))

===
tset statement
===

(tset tbl field 19)

---

(program
  (tset
    (identifier)
    (identifier)
    (number)))

===
each loop
===

(each [key value (pairs {"key1" 52 "key2" 99})]
  (print key value))

---

(program
  (each 
    (each_clause
      (identifier)
      (identifier)
      (function_call
        name: (identifier)
        (table
          (string)
          (number)
          (string)
          (number))))
    (function_call
      name: (identifier)
      (identifier)
      (identifier))))
    
===
for loop
===

(for [i 1 10]
  (print i))

(for [i 1 10 2]
  (print i))

---

(program
  (for
    (for_clause
      (identifier)
      (number)
      (number))
    (function_call
      name: (identifier)
      (identifier)))
  (for
    (for_clause
      (identifier)
      (number)
      (number)
      (number))
    (function_call
      name: (identifier)
      (identifier))))

===
while loop
===

(while (keep-looping?)
  (do-something))

---

(program
  (while
    condition: (function_call 
                name: (identifier))
    (function_call
      name: (identifier))))

===
if statement
===

(let [x (math.random 64)]
  (if (= 0 (% x 2))
      "even"
      (= 0 (% x 10))
      "multiple of ten"
      "I dunno, something else"))

---

(program
  (let_definition
    (assignments
      (assignment
        (identifier)
        (function_call
          name: (identifier)
          (number))))
    (if_statement
     (function_call
      name: (identifier)
      (number)
      (function_call
       name: (identifier)
       (identifier)
       (number)))
      (string)
      (function_call
        name: (identifier)
        (number)
        (function_call
         name: (identifier)
         (identifier)
         (number)))
      (string)
      (string))))
        
===
when statement
===

(when (currently-raining?)
  (wear "boots")
  (deploy-umbrella))

---

(program
  (when_statement
    (function_call name: (identifier))
    (function_call 
      name: (identifier)
      (string))
    (function_call name: (identifier))))
